app/controllers/dogs_controller.rb

    def index
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def show
        @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def adopt_form
        @dog = Dog.find(params[:id])
        @employees = Employee.all
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "employees".* FROM "employees"

    def adopt
        employee = Employee.find(params[:dog][:employee])
        employee.update(dog_id: params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "employees" SET "dog_id" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["dog_id", 6], ["updated_at", "2019-06-11 13:59:59.815081"], ["id", 5]]